import pandas as pd
import datetime

desired_width = 320
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
pd.set_option('display.width', desired_width)
pd.set_option("display.colheader_justify","left")

a = {"1":["Самелье Карен Вахтангович", "Мужской", datetime.date(1987, 4, 11), 89381052115, 2451645,
          '430232 Мурино, кв. 7', 120 ],
     "2": ["Божко Игорь Петрович", "Мужской", datetime.date(1991, 7, 18), 893810453152, 3161515,
           '430251 Савирненко, дом 12', 135],
     "3": ["Аминова Анна Павловна", "Женский", datetime.date(1987, 4, 11), 89383415267, 1251635,
           '430251 Балино, дом 15', 115],
     "4": ["Верещаев Олег Викторович", "Мужской", datetime.date(2000, 5, 16), 8938143567, 72421425,
           '430251 Балино, дом 15', 161],
     "5": ["Тулин Николай Викторович", "Мужской", datetime.date(1992, 6, 18), 8938132174, 5166425,
           '430232 Кемино, кв. 14', 210],
     "6": ["Типовая Инна Валерьевна", "Мужской", datetime.date(1961, 6, 7), 89284758821, 4161425,
           '430151 Таврино, дом 6А', 120],
     "7": ["Кидалов Тимьян Карасевич", "Мужской", datetime.date(1942, 3, 9), 8938104553, 1921425,
           '430523 Мировая, кв.14', 155],
     "8": ["Силуанова Сара Израильевна", "Женщина", datetime.date(1941, 7, 13), 8938104543, 7371425,
           '430251 Балино, дом 15', 132],
     "9": ["Мирин Олег Викторович", "Мужской", datetime.date(1982, 11, 23), 89381045431, 6561425,
           '430251 Балино, дом 15', 171],
     "10": ["Сапалов Игнат Аркадьевич", "Мужской", datetime.date(1995, 11, 18), 89281745551, 9235425,
            '430251 Балино, дом 15', 163]}

data = []
for k,v in a.items():
 data.append(v)

df = pd.DataFrame(data = data, columns=["ФИО", "Пол", "Дата рождения", "Номер мобильного",
"Домашний телефон", "Адрес", "Давление"])
df["Дата рождения"] = pd.to_datetime(df["Дата рождения"])
print(pd.DataFrame(df))
print("\n")

#df.sort_values(by = ["Дата рождения"], ascending=False, inplace=True)
newdf = df[df["Давление"] > 140].nlargest(1, "Дата рождения")
print(newdf)